emacs/pgpb/pgpb-org-agenda-commands.org
#+PROPERTY: header-args :results verbatim :tangle pgpb-org-agenda-commands.el :session agenda-commands :cache no
#+auto_tangle: t

* TODO Custom agenda commands: [[file:pgpb-org-agenda-commands.el][file]]

** Warn: auto-generated file

   #+begin_src elisp
     ;;; WARNING: Do NOT edit this file.
     ;; This file is generated from the Org file via =org-tangle= 
   #+end_src



** Variables to filter items in the agenda

*** Daily agenda view

    This view functions as a daily checklist. It contains all things
    that I want to have present during my day.
    
    #+begin_src elisp
      (setq daily-tags '("+daily" "-private" "-template"))
    #+end_src

   
*** Hide common tags in agenda view to keep it clean

    Too many tags can make the agenda view ugly, so I will 
    hide common tags so that there are no multi-line
    entries in the agenda view:
   
    #+begin_src elisp
      (setq org-agenda-hide-tags-regexp
            (regexp-opt '("goal"
                          "task"
                          "action"
                          "hobby"
                          "PROJECT"
                          "reminder"
                          "recurring"
                          "time"
                          "info"
                          "journal"
                          "track"
                          "termin"
                          "bookmark")))
    #+end_src



*** Entries that should not appear in the agenda

    I want to only see pending tasks in the agenda view, so I exclude
    all informational entries from it:
   
    #+begin_src elisp
      (setq hidden "-info-journal-reminder-hobby-dream/-INFO-DONE-WONTDO-IGNORE")
    #+end_src


** Define custom agenda commands

   Org reads custom agenda commands from a global variable:

   #+begin_src elisp
     (setq org-agenda-custom-commands 
           (append (list
                    (pgpb-org-public-tasks)
                    (pgpb-org-all)
                    (pgpb-org-daily)
                    (pgpb-org-time)
                    (pgpb-org-now)
                    (pgpb-org-meetings))
                   (pgpb-org-find)
                   (pgpb-org-goals)
                   (pgpb-org-reminder)
                   (pgpb-org-ooo)))
   #+end_src


** Agenda view: daily checklist

   Show my daily checklist:
   
   #+begin_src elisp
     (defun pgpb-org-daily ()
       '("d" "Daily checklist"
         ((agenda ""))
         ((org-agenda-tag-filter-preset daily-tags))
         ))
   #+end_src


** Agenda view: public tasks

   Removes all private tasks from the agenda view:
   
   #+begin_src elisp
     (defun pgpb-org-public-tasks ()
       '("k" "Public tasks"
         ((agenda ""))
         ((org-agenda-tag-filter-preset '("-daily" "-improve" "-private" "-template")))
         ))
   #+end_src


** Agenda view: time trackers

   Show all items that I typically use to track time.
   There are certain work items that do not merit their /TODO/ entry,
   instead I track time for those in bulk using /time tracker/ entries
   for specific categories or work.

   #+begin_src elisp
     (defun pgpb-org-time ()
            '("f" "Time tracking" tags (concat "+time+track" hidden)))
   #+end_src


** Agenda view: do now!

   This view shows only those items with priority /A/. It does so by
   removing from all entries that do not match the regex:

   #+begin_src elisp
     (defun pgpb-org-now ()
       ;; Filter by priority
       ;; https://emacs-orgmode.gnu.narkive.com/bsur8gfw/orgmode-custom-agenda-view-filter-by-priority-and-scheduled-date
       '("n" "Now! a.k.a. Prio=A"
         ((agenda ""))
         ((org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\\[#A\\]")))
         ))
   #+end_src


** Agenda view: all tasks

   Show all tasks, include private tasks:
   
   #+begin_src elisp
     (defun pgpb-org-all ()
       '("l" "All tasks"
         ((agenda ""))
         ((org-agenda-tag-filter-preset '("-daily" "-improve" "-template")))
         ))
   #+end_src



** Agenda view: meetings

   Show all meetings: 

   #+begin_src elisp
     (defun pgpb-org-meetings ()
       '("j" "All meetings"
         ((agenda ""))
         ((org-agenda-tag-filter-preset '("+termin" "-template")))
         ))
   #+end_src

   
** Text search: Find/Search

   Text search across different categories of files, e.g., journal or
   archive: 

   #+begin_src elisp
     (defun pgpb-org-find ()
            '(("F" . "Find/Search")
              ("Fj" "Journal search" search ""
               ((org-agenda-files (pgpb-org-journal-files))))
              ("Fa" "Archive search" search ""
               ((org-agenda-files (pgpb-org-archive-files))))
              ("Fe" "Search everywhere" search ""
               ((org-agenda-text-search-extra-files (pgpb-org-extra-files))))))
   #+end_src
   

** Tag search: goals

   Various views to show goal-related tasks:

   More details in: [[id:E5B8D3A5-66EF-45A2-BB21-BADDC147650A][Goal, Task, Action]]

   #+begin_src elisp
     (defun pgpb-org-goals ()
       ;; See Org etry: =C-c h goals task action=
       ;; (org-id-goto "E5B8D3A5-66EF-45A2-BB21-BADDC147650A")
       '(("g" . "Goals, Hobbies and Dreams")
         ("gg" "Goal definition" tags (concat "+goal+def" hidden))
         ("gh" "Hobbies" tags (concat "+hobby+def" hidden))
         ("gd" "Dreams" tags "+dream+def")
         ;; Items that are not associated to any goal/hobby
         ;; (org-id-goto "A753CCF1-D6DF-47CF-BF16-067BD937E30A")
         ("gz" "Dangling/Zombie items" tags (concat "-pom-fit-cn-de-blog-meta-job-hobby" hidden))))
   #+end_src


** Agenda views: reminders

   Find different kinds of reminders:
   
   #+begin_src elisp
     (defun pgpb-org-reminder ()
            '(("R" . "Reminders")
              ("Rd" "Daily reminders"
               ((agenda ""))
               ((org-agenda-tag-filter-preset daily-tags))
               )
              ("Ra" "All Reminders"
               ((agenda ""))
               ((org-agenda-tag-filter-preset '("+reminder" "-template")))
               )
              ("Ro" "Other Reminders"
               ((agenda ""))
               ((org-agenda-tag-filter-preset '("+reminder" "-template" "-daily")))
               )))
   #+end_src


** Agenda view: Out of Office

   Show the times where I will not be working:
   
   #+begin_src elisp
     (defun pgpb-org-ooo ()
        '(("O" . "Out of Office")
          ("Om" "Monthly view"
           ((agenda ""))
           ((org-agenda-span 'month)
            (org-agenda-tag-filter-preset '("+ooo")))
           )
          ("Oa" "All events" tags "+ooo/-INFO")))
   #+end_src

   
** Agenda view: improvements

   Show the list of improvements I want to make:
   
   #+begin_src elisp
     (defun pgpb-org-improve ()
       '(("I" . "Improvements")
         ("Ib" "Backlog" tags "+improve-info/-DONE-INFO-WONTDO")
         ("Iw" "work in progress"
          ((agenda ""))
          ((org-agenda-tag-filter-preset '("+improve")))
          )))
   #+end_src
  

** Export package

   #+begin_src elisp
    (provide 'pgpb-org-agenda-commands)
   #+end_src


** Org docs: Custom agenda command examples: [[https://orgmode.org/manual/Matching-tags-and-properties.html][open]]
   
   Examples: https://orgmode.org/manual/Matching-tags-and-properties.html

  
